
bool_true = True  # Істина, 1
bool_false = False  # Брехня, 0

# Порівняння чисел
print(20 > 10)
print(20 < 10)

print(20 >= 20)  # більше або дорівнює
print(10 <= 100)  # менше або дорівнює

print(10 == 10.0)  # дорівнює
print(25 != 25.0)  # не дорівнює

# Порівняння строк
print('abc' > 'ABC')  # на > < строки порівнюються за unicode

print('abc' == 'acb')  # на == строки порівнюються на ідентичність
print('25' != '25.0')

# Об'єдання порівнянь

# і (and) - потребує True всюди (зліва та зправа)
print(True and True)
print(False and True)
print(False and False)

# або (or) - потребує True хоч десь
print(True or True)
print(False or True)
print(False or False)

print(not True)
print(not False)

'''
Задача: користувач вводить в консоль число. Результатом поверніть:
"Число більше нуля", "Число менше нуля" або "Число дорівнює нулю" 
'''

number = int(input('Введіть число: '))

if number > 0:  # якщо <умова == True>: <код>
    print('Число більше нуля!')
elif number < 0:  # в іншому випадку, якщо <умова == True>: <код>
    print('Число менше нуля!')
else:  # в усіх інших випадках: <код>
    print('Число дорівнює нулю!')


'''
Структура умови:
- 1 if;
- скільки завгодно elif (0 також). Перевіряються по черзі;
- 0 або 1 else
'''
