import os
from typing import Any

# --- Конфігурація та константи ---

# Шлях до папки та файлу для зберігання даних
DATA_DIR = 'files'
DATABASE_FILE = os.path.join(DATA_DIR, 'salary_data.json')

# Список допустимих місяців українською для валідації та форматування дат
MONTHS: list[str | Any] = [
    "Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень",
    "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень"
]

# Допустимі рівні працівників для валідації
EMPLOYEE_LEVELS = ["Junior", "Middle", "Senior", "Team Lead"]

# Константы станів для управління діалогами в Telegram боті
STATE_IDLE = 0 # Стан, коли бот не очікує конкретного введення від користувача

# Стани для діалогу додавання запису про зарплату
STATE_ADD_SURNAME = 1 # Очікуємо прізвище працівника
STATE_ADD_FIRST_NAME = 2 # Очікуємо ім'я працівника
STATE_ADD_PATRONYMIC = 3 # Очікуємо по-батькові працівника
STATE_ADD_MONTH = 4 # Очікуємо місяць і рік
STATE_ADD_LEVEL = 5 # Очікуємо рівень працівника
STATE_ADD_HOURS = 6 # Очікуємо фактично відпрацьовані години
STATE_ADD_TASKS = 7 # Очікуємо вартість виконаних завдань
STATE_ADD_USD = 8 # Очікуємо курс долара
STATE_ADD_EUR = 9 # Очікуємо курс євро (фінальний крок додавання)

# Стани для діалогу редагування запису
STATE_EDIT_ID = 10 # Очікуємо ID запису для редагування
STATE_EDIT_FIELD = 11 # Очікуємо назву поля для редагування
STATE_EDIT_VALUE = 12 # Очікуємо нове значення для поля (фінальний крок редагування)

# Стани для діалогу видалення запису
STATE_DELETE_ID_CONFIRM = 13 # Очікуємо ID запису для видалення (фінальний крок видалення)

# Стани для діалогів звітів
STATE_REPORT_MONTH_INPUT = 14 # Очікуємо місяць і рік для звіту за місяць
STATE_REPORT_YEAR_INPUT = 15 # Очікуємо рік для річного звіту
